#+TITLE: My .emacs file
#+STARTUP: content
#+PROPERTY: header-args:emacs-lisp :results output silent :tangle ~/.emacs

* TODO Jupyter Mode
#+Begin_src emacs-lisp :tangle no
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
  (use-package zmq)
  (use-package jupyter
    :after (:all org python))
  ;;(org-babel-jupyter-override-src-block "python")
  (setq ob-async-no-async-languages-alist '("jupyter-python" "jupyter-julia"))
#+end_src

Install Conda

#+begin_src emacs-lisp :tangle no
  (use-package conda
    :config
    (conda-env-initialize-interactive-shells)
    (conda-env-initialize-eshell)
    (conda-env-autoactivate-mode t)
    (setq conda-anaconda-home (expand-file-name "~/miniconda3/"))
    (setq conda-env-home-directory (expand-file-name "~/miniconda3/"))
    (setq conda-env-subdirectory "envs"))
#+end_src



#+BEGIN_SRC python :session  :tangle no
  x = 'foo'
  y = 'bar'
  x + ' ' + y
#+END_SRC

#+RESULTS:
: foo bar

#+BEGIN_SRC python :session :tangle no
  import sys
  sys.executable
#+END_SRC

#+RESULTS:
: /Users/monibahmed/miniconda3/bin/python
